package com.small.world.fiction.config

class TextConfig {
    companion object{
        val pageContent = "这么大的艺术品拍卖当然不是说拍就能拍。\n" +
                "\n" +
                "任重签完合同，索斯比根据任重提供的书画作品还要预热造势，同潜在买家沟通信息，还要开展各种商业推广等等，这些林林总总的前置工作搞完，起码得一个月以上，这是为了双方利益最大化拍出高价必要商业手段，任重当然不会有异议，他又不着急这点时间。\n" +
                "\n" +
                "“皮特先生，我这边想要开设海外银行卡账户以及开设一些离岸公司，你能为我推荐一些靠谱的咨询代理商吗？”处理好拍卖诸事，将拍卖品送到第三方专业贵重物品保管处后，任重对皮特说道，他不知道这个拍卖行有没有这样的服务，但是想到这些都是做高端客户生意的，或许有自己的渠道。\n" +
                "\n" +
                "刚刚做成了一笔大生意的皮特，心情大好。\n" +
                "\n" +
                "“当然，任先生，我们有为高净值客户服务的贴身工商咨询代理商，比如玛格丽特私人工商服务有限公司，”皮特说道，“我会为任先生办理一张索斯比尊贵svip卡，持卡去玛格丽特公司或者任何一家世界知名银行，他们都会为任先生提供贴身定制的服务。”\n" +
                "\n" +
                "皮特口中的索斯比svip卡，是在索斯比交易达到1亿以上的高端客户证明，很快皮特就从拍卖行中拿出了一张烫金黑卡，正面是索斯比及其公司logo，后面是svip。\n" +
                "\n" +
                "没有半点低调内敛，看上去就有一种奢华贵气的感觉。这些顶级机构办事就是靠谱，把暴发户心态拿捏得死死的，哪怕是任重，现在对这张卡片也有一种肃然起敬的感觉。\n" +
                "\n" +
                "“谢谢皮特先生的帮助，我想，下一次的交易，索斯比将会是我第一选择。”任重的话，让皮特感觉自己的努力没有白费，这个年轻人虽然其貌不扬，但是一来就能做出上亿的交易，未来潜力可见一斑，这种客户，值得皮特为对方付出更多。\n" +
                "\n" +
                "拿到了索斯比的svip卡，任重先到了汇峰一家银行，他没有给银行客户经理狗眼看人低的机会，直接拿出这张svip卡，港岛混银行客户经理，不可能不知道索斯比，当然也不可能不认识他们家的顶配svip卡，所以直接领任重到vip室单独为他服务，开出了jade尚玉卡！这张卡要求是存款620万起，可以做到全球转账秒到！支持各种奢华消费的专属服务，什么私人飞机、专属酒店、全球秀场、演唱会指定位置门票等等都能替你办到！\n" +
                "\n" +
                "只要你打钱就行。\n" +
                "\n" +
                "任重看了一下它的服务指南后，果断决定以后少看！拿这个考验干部，那真是顶不住啊！\n" +
                "\n" +
                "他只看中的是资金在海外的自由流转功能，感觉很快自己就会遇到。\n" +
                "\n" +
                "搞定了汇峰，任重又来到琪，同样开了一张顶级卡备用。\n" +
                "\n" +
                "然后才去玛格丽特公司，有索斯比的svip，任重在他们家vip贵宾室很快谈妥为他代理开办了两家公司：一家是放到开曼群岛的离岸公司-云龙投资有限公司，一家是放到港岛的公司-云飞兄弟投资有限公司。\n" +
                "\n" +
                "他们的作用就是承接住任重跨位面交易带来的资金，好名正言顺给任重旗下几家搞实业的公司输血，所以公司名字什么的任重根本没有多想，直接给李云龙和楚云飞隔空送了一波名义福利。\n" +
                "\n" +
                "想必两个一生纠缠不休的冤家对头是不会有意见的，就不必跨越时空去征求他们的意见了。按照任重最新的商业规划，通过开曼群岛的云龙投资有限公司吸收来自亮剑世界的变现资金，通过离岸公司的保密制度，最大限度去保住自己这个穿梭不同世界获得资源的终极秘密，把现实世界中自己开拓商业研究的资金来源有一个很好解释的源头。\n" +
                "\n" +
                "当然这是对于普通人来说的保护措施，对于强力机构，这些伪装其实也等于零。"


        val TOPIC_ARRAY = mutableListOf< String>(
            "纯爱" , "衍生" , "综影视" , "赛博朋克" , "悬疑恋爱" , "悬疑" , "克苏鲁" , "都市异能" , "末日求生" , "灵气复苏" , "高武世界" , "异世大陆" , "东方玄幻" , "悬疑" , "清朝" , "宋朝" , "断层","武将" ,"国运","职场商战","日久生情", "豪门世家","综漫", "异世穿越","独宠","开局","架空","奇幻仙侠","都市","现代言情","古代言情","玄幻","历史","体育","武侠","幻想言情"
        )
        val ROLES_ARRAY  = mutableListOf<String>(
            "总裁" , "多女主" , "赘婿" , "作精" , "大佬" , "大小姐" , "特工" , "游戏主播" , "神探" , "宫廷侯爵" , "皇帝" , "将军" , "毒医" , "厨娘" , "律师" , "医生" , "明星" , "替身" , "双面" , "冰山" , "古灵精怪" , "天作之合" , "可盐可甜" , "无CP" , "单女主" , "校花" , "无女主" , "病娇" , "女帝" , "特种兵" , "反派" , "萌宝" , "神医" , "宠妻" , "奶爸" , "学霸" , "公主" , "皇后","王妃","女强" , "皇叔" , "嫡女" , "精灵" , "天才" , "腹黑" , "反击猪吃虎" , "团宠"
        )
        val PLOTS_ARRAY = mutableListOf<String>(
            "女频悬疑", "西方奇幻", "东方仙", "古风世情", "科幻末世", "男频衍生", "女频衍生", "民国言情", "都市高武", "悬疑灵异", "悬疑脑洞", "抗战侠电影战", "青春甜宠", "双男主",
            "古言脑洞", "历史古代", "历史脑洞", "现言脑洞", "都市种田", "都市脑洞", "都市日常", "玄幻脑洞", "玄幻言情", "宫斗宅斗", "豪门总裁", "战神赘婿", "导出", "星光璀璨",
            "游戏体育动漫", "职场婚恋", "双女主", "传统玄幻", "都市修真", "年代", "种田", "快穿", "西游衍生", "公版衍生", "红楼衍生", "甄嬛衍生", "如懿衍生", "斩神衍生",
            "十日衍生", "四合院", "电竞", "多元生", "前世今生", "乡村", "逃荒", "同人", "打脸穿", "破案", "囤物资", "钓鱼", "他", "相爱相杀", "暗恋穿", "逃婚", "带球跑", "强强",
            "一见钟情", "众人奔赴", "破镜重圆", "契约婚姻", "隐婚", "闪婚", "今古", "古今", "群穿", "护短", "虐渣", "情有独钟", "马甲", "医术", "网游", "奥特同人", "求生",
            "女扮女装", "青梅竹马", "无敌", "民国", "九叔", "穿书", "聊天群", "大秦", "龙珠", "漫威", "神奇宝贝", "海贼", "火影", "职场", "明朝", "家庭", "三国", "末世",
            "直播", "无限流", "诸天万界", "兽世", "大唐", "宠物", "外卖", "清穿", "星际", "美食", "剑道", "盗墓", "虐文", "甜宠", "灵异", "校园", "鉴宝", "系统", "神豪",
            "重生", "穿越", "二次元", "海岛", "娱乐圈", "空间", "推理", "洪荒"
        )

        val FIRST_CHAPTER_GEN = "大概内容是，有两个人争风吃醋，双方都受伤后。故事以第一人称“我”来展开，读者以为这个“我”是同一个人，其实，后面的“我”是指另一个受伤的人。在这种认知偏差下，“我”去找药方，便产生了一系列的错愕情节。"

        val GENERATED = "generated"

        val PENDING = "pending"

        val CREATIVITY = "creativity"
    }
}